app/controllers/user_controller.rb

INSERT INTO "users" ("created_at", "email_id", "password", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-18 07:54:23.848441"], ["email_id", "vijayakumar@kreatio.com"], ["password", "123"], ["updated_at", "2014-09-18 07:54:23.848441"]]
---
def register_user
  password = Digest::MD5.hexdigest(params[:user][:password])
  params[:user].merge!(:password=>password)
  user_params = params.require(:user).permit(:email_id,:password)
  User.create(user_params)

SELECT  "users".* FROM "users"  WHERE (email_id = 'E-mail Address' and password = '$2a$10$rHkWU.M2Wd8v28pXysd42eumm7zB5Ud4YrwxINfE3vIDG76XQi5/a')  ORDER BY "users"."id" ASC LIMIT 1
---
def login
  email = params[:user][:email_id]
  pwd = params[:user][:password]
  password = Digest::MD5.hexdigest(pwd)
  @user = User.where("email_id = ? and password = ?",email,password).first